Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: For delays of finer granularity than one second, the Time::HiRes module (from CPAN, and starting from Perl 5.8 part of the standard distribution) provides ualarm().
es_es: Para lapsos de tiempo inferiores a un segundo, el módulo Time::HiRes (en CPAN, y desde Perl 5.8 parte de la distribución estándar) ofrece ualarm().

source: Assignment operators work as in C. That is,
es_es: Operadores de asignación funcionan como en C. Es decir,

source: This implicit localization occurs I<only> in a C<foreach> loop.
es_es: Esta implícita localización ocurre I<solamente> en un bucle C<foreach>.

source: Perl 6 was an oft used term for Chip Salzenberg's project to rewrite Perl in C++ named Topaz.
es_es: Perl 6 era un nombre que se solía usar para hacer referencia a un proyecto de Chip Salzenberg, con nombre clave Topaz, consistente en reescribir Perl en C++.

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://bugs.perl.org.
es_es: Si usted encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://bugs.perl.org/.

source: The $expire field, if present, encodes the expiration period of the account or the password.
es_es: El campo $expira, si está presente, codifica el periodo de expiración de la cuenta o de la contraseña.

source: Actually, one good reason is when you already have an existing application written in another language that's all done (and done well), or you have an application language specifically designed for a certain task (e.g. prolog, make).
es_es: La verdad, una buena razón es tener una aplicación escrita en otro lenguaje que funciona bien y está bien programada, o disponer de un lenguaje para aplicaciones diseñado específicamente para una tarea determinada (como prolog o make).

source: $a = $b or $c; # bug: this is wrong
es_es: $a = $b or $c; # error: esto está mal

source: There are two new cases where C<when> now interprets its argument as a boolean, instead of an expression to be used in a smart match:
es_es: Hay dos nuevos casos en el que ahora C<when> interpreta su argumento como un valor booleano, en lugar de una expresión que se utiliza en una coincidencia inteligente:

source: =head2 Version numbering
es_es: =head2 Numerado de versión

source: =head2 Install
es_es: =head2 Instalación

source: =item eof FILEHANDLE X<eof> X<end of file> X<end-of-file>
es_es: =item eof IDENTIFICADOR_ARCHIVO X<eof> X<end of file> X<end-of-file> X<fin de archivo>

source: otherwise it's necessary to protect any leading and trailing whitespace:
es_es: de lo contrario es necesario proteger los espacios en blanco iniciales y finales:

source: For the constructs except here-docs, single characters are used as starting and ending delimiters.
es_es: Para las construcciones, salvo los documentos incrustados, caracteres simples son utilizados como delimitadores de inicio y finalización.

source: $a = $ok ? $b : $c; # get a scalar
es_es: $a = $ok ? $b : $c; # obtiene un escalar

source: Or the opposite of a C<push>, depending on how you look at it.
es_es: O lo contrario de un C<push>, dependiendo de cómo se mire.

source: shmread() taints the variable.
es_es: shmread() contamina a la variable.

source: (Quads are available only if your system supports 64-bit
es_es: (Cuádruplos están disponibles solo si su sistema soporta valores

source: The C<o?> matches at the beginning of C<'foo'>, and since the position in the string is not moved by the match, C<o?> would match again and again because of the C<*> quantifier.
es_es: El C<o?> coincide con el inicio de C<'foo'>, y como la posición en la cadena no se ha movido por la coincidencia, C<o?> coincidirá una y otra vez a causa del cuantificador C<*>.

source: This may include dynamically looking back your call-stack at run time to find the LABEL.
es_es: Esto puede incluir el analizar la pila de llamadas, de forma dinámica, en tiempo real, para encontrar la ETIQUETA.

source: @articles = sort {$a <=> $b} @files;
es_es: @articulos = sort {$a <=> $b} @archivos;

source: This directory contains XS-using modules which are only released as part of the core.
es_es: Este directorio contiene módulos que usan XS y que solo se publican como parte del núcleo.

source: Return C<undef> or an empty list if the C C<gettimeofday()> function fails
es_es: Devuelve C<undef> o una lista vacía si falla la función en C C<gettimeofday()>

source: The name of the Copyright Holder may not be used to endorse or promote products derived from this software without specific prior written permission.
es_es: El nombre del Titular del Copyright no puede utilizarse para apoyar o promocionar productos derivados de este software sin previo consentimiento escrito.

source: left or xor
es_es: izquierda or xor

source: Its exact size depends on what a local C compiler calls 'int'.)
es_es: Su tamaño exacto depende de lo que un compilador C local llama 'int').

source: Perl was ported to Mac OS by Matthias Neeracher E<lt>neeracher@mac.comE<gt>.
es_es: Perl fue adaptado a Mac OS por Matthias Neeracher E<lt>neeracher@mac.comE<gt>.

source: =head1 ACKNOWLEDGEMENTS
es_es: =head1 AGRADECIMIENTOS

source: [This function has been largely superseded by the C<tie> function.]
es_es: [Esta función ha sido largamente supeditada por la función C<tie>].

source: This effectively means that the regex engine "skips" forward to this position on failure and tries to match again, (assuming that there is sufficient room to match).
es_es: Esto significa que, efectivamente, el motor de expresiones regulares "salta" hacia adelante a esta posición en caso de fallo y trata de coincidir de nuevo, (suponiendo que haya espacio suficiente para que coincida).

source: @contact = sort(find_records @key);
es_es: @contacto = sort(busca_registros @claves);

source: Of course, the Artistic License spells all this out for your protection, so you may prefer to use that.
es_es: Por supuesto, la Licencia Artística hechiza todo esto, para su protección, por lo que quizás prefiera usarla.

source: I<STRING> is interpolated the same way as I<PATTERN> in C<m/PATTERN/>.
es_es: I<CADENA> es interpolada de la misma manera que I<PATRÓN> en C<m/PATRÓN/>.

source: "Punctuation" arrays such as C<@*> are usually interpolated only if the name is enclosed in braces C<@{*}>, but the arrays C<@_>, C<@+>, and C<@-> are interpolated even without braces.
es_es: Los arrays de "puntuación" como C<@*> son normalmente interpolados solo si el nombre está encerrado entre llaves C<@{*}>, pero los arrays C<@_>, C<@+>, y C<@-> son interpolados, incluso sin llaves.

source: (Because backticks always undergo shell expansion as well, see L<perlsec> for security concerns.) X<qx> X<`> X<``> X<backtick> X<glob>
es_es: (Debido a que las comillas invertidas siempre provocan una expansión a nivel de shell, vea someterse a expansión de la shell, vea L<perlsec> por motivos de seguridad). X<qx> X<`> X<``> X<backtick> X<glob> X<comilla invertida>

source: 10 ctime inode change time in seconds since the epoch (*)
es_es: 10 ctime tiempo cambio inodo, en segundos desde el (*)

source: $count = ($paragraph =~ s/Mister\b/Mr./g); # get change-count
es_es: $contador = ($parrafo =~ s/Señor\b/Sr./g); # obtener el número de cambios

source: README.vmesa - building and installing Perl for VM/ESA.
es_es: README.vmesa - compilando e instalando Perl en VM/ESA.

source: That's because unlike C, in perl you can't freely interchange arrays and references thereto.
es_es: Eso es porque, a diferencia de C, en perl no puede intercambiar libremente los array y referencias a ellos.

source: "lt", "le", "ge", "gt" and "cmp" use the collation (sort) order specified by the current locale if C<use locale> is in effect.
es_es: "lt", "le", "ge", "gt" y "cmp" usan el orden de intercalación (sort) especificado por la configuración regional actual si C<use locale> está en vigor.

source: To (re)open C<STDOUT> or C<STDERR> as an in-memory file, close it first:
es_es: Para (re)abrir C<STDOUT> o C<STDERR> como un archivo en memoria, primero, cierrelos:

source: If your input is binary, and is supposed to remain binary, you shouldn't decode it to a text string, of course.
es_es: Por supuesto, si la entrada es binaria y debe permanecer así, no debe descodificarla en una cadena de texto.

source: if ($in_header) { # do something
es_es: if ($en_cabecera) { # hacer algo

# print "6: got $1 " if $y =~ /^(D*)(?=d)(?!123)/;
source: print "6: got $1\n" if $y =~ /^(\D*)(?=\d)(?!123)/;
es_es: print "6: tenemos $1\n" if $y =~ /^(\D*)(?=\d)(?!123)/;

source: For characters C<"a".."f"> and C<"A".."F">, the result is compatible with the usual hexadecimal digits, so that C<"a"> and C<"A"> both generate the nybble C<0xA==10>.
es_es: Para los caracteres C<"a".."f"> y C<"A".."F">, el resultado es compatible con los dígitos hexadecimales acostumbrados, de modo que C<"a"> y C<"A"> generan ambos el nible C<0xA==10>.

source: For instance the above example could also be written as follows:
es_es: Por ejemplo, el ejemplo anterior también se podría escribir de la siguiente manera:

source: / (Y) # group 1 ( # group 2 (X) # group 3 \g{-1} # backref to group 3 \g{-3} # backref to group 1 )
es_es: / (Y) # grupo 1 ( # grupo 2 (X) # grupo 3 \g{-1} # contraref. a grupo 3 \g{-3} # contraref. a grupo 1 )

source: It doesn't become false till the next time the range operator is evaluated.
es_es: No se vuelve falso hasta la próxima vez que el operador rango es evaluado.

source: C<FileCache> upgraded to version 1.06
es_es: C<FileCache> actualizado a la versión 1.06

source: 200) { print; } # print 2nd hundred lines, short for # if ($.
es_es: 200) { print; } # imprime las segundas cien líneas, # versión corta de ($.

source: or die "Can't open memory file: $!";
es_es: or die "No puedo abrir el archivo en memoria: $!";

source: Closing any piped filehandle causes the parent process to wait for the child to finish, then returns the status value in C<$?> and C<${^CHILD_ERROR_NATIVE}>.
es_es: Cerrando cualquier identificador de archivo entubado hace que el proceso padre espere a que el hijo termine, y devuelva el valor de estado en C<$?> y en C<${^CHILD_ERROR_NATIVE}>.

source: C<$hinthash> is a reference to a hash containing the value of C<%^H> when the caller was compiled, or C<undef> if C<%^H> was empty.
es_es: C<$hinthash> es una referencia a un hash conteniendo el valor de C<%^H> cuando el llamante ha sido compilado, o C<undef> si C<%^H> estaba vacío.

source: Also, the boilerplate test is now called F<t/Foo-Bar.t> instead of F<t/1.t>.
es_es: Además, la prueba reutilizable se llama ahora F<t/Foo-Bar.t> en lugar de F<t/1.t>.

source: s/\bgreen\b/mauve/g; # don't change wintergreen
es_es: s/\bverde\b/malva/g; # no cambia verdeazul

source: The Socket library makes this slightly easier:
es_es: La biblioteca Socket hace esto ligeramente más fácilmente:

source: Without the C</g> modifier, the C<\G> assertion still anchors at C<pos()> as it was at the start of the operation (see L<perlfunc/pos>), but the match is of course only attempted once.
es_es: Sin el modificador C</g>, la aserción C<\G> todavía se ancla en pos() como si fuera al principio de la operación (vea L<perlfunc/pos>), pero la coincidencia, por supuesto, sólo es probada una vez.

source: Since version 5.8.1, perl uses the /d switch when running the cmd.exe shell internally for system(), backticks, and when opening pipes to external programs.
es_es: Desde la versión 5.8.1, perl usa el modificador /d cuando se ejecuta el shell cmd.exe, internamente, para system(), comillas invertidas, y al abrir tuberías hacia programas externos.

source: Abstract namespace sockets are Linux-specific socket type that live in AF_UNIX family, slightly abusing it to be able to use arbitrary character arrays as addresses: They start with nul byte and are not terminated by nul byte, but with the length passed to the socket() system call.
es_es: El espacio de nombres para sockets Abstract son un tipo específico de socket Linux que viven en la familia AF_UNIX, un poco abusando de ella para poder utilizar matrices arbitrarias de array de caracteres tal y como se indica: comienzan con el byte nulo y no se termina con el byte nulo, sino con la longitud pasada a la llamada del sistema socket().

source: =head1 BUGS
es_es: =head1 ERRORES

source: One can now specify a destination directory for Perl installation by specifying the DESTDIR variable for C<make install>.
es_es: Ahora se puede especificar un directorio destino para la instalación de Perl mediante la especificación de la variable DESTDIR para C<make install>.

source: Programs that want to lie to themselves about what was just input normally use this command:
es_es: Los programas que quieren engañarse a sí mismos acerca de lo que se acaba de introducir suelen utilizar este comando:

source: An example of how this might be used is as follows:
es_es: Un ejemplo de cómo esto podría ser utilizado es lo siguiente:

source: foreach $file (@filenames) {
es_es: foreach $archivo (@archivos) {

source: Perl 5.8.1 uses the /d switch when running the cmd.exe shell internally for system(), backticks, and when opening pipes to external programs.
es_es: Perl 5.8.1 usa el modificador /d cuando se ejecuta el shell cmd.exe, internamente, para system(), comillas invertidas, y al abrir tuberías hacia programas externos.

source: perlthrtut Perl threads tutorial
es_es: perlthrtut Tutorial de subprocesos

source: If the code to be executed doesn't vary, you may use the eval-BLOCK form to trap run-time errors without incurring the penalty of recompiling each time.
es_es: Si el código a ser ejecutado no varía, puede usar la forma BLOQUE de eval para atrapar errores en tiempo de ejecución sin incurrir en la penalidad de recompilar cada vez.

source: Previously such assignments would suffer from integer wrap-around during size calculations causing a misallocation, which would crash perl, and could theoretically be used for "stack smashing" attacks.
es_es: Previamente, tales asignaciones podrían verse afectados por la pasada de vuelta de los enteros en los cálculos del tamaño, que causa una mala distribución, que provocaría una caída de perl, y teóricamente podrían ser utilizados para realizar ataques de "ruptura de pila".

source: scalar @array slice: @array[0, 2] @hash{'a', 'b'}
es_es: escalar @array porción: @array[0, 2] @hash{'a', 'b'}

source: One can now build subsets of Perl core modules by using the Configure flags C<-Dnoextensions=...> and C<-Donlyextensions=...>, see F<INSTALL>.
es_es: Ahora se pueden crear subconjuntos de módulos básicos de Perl usando las banderas de Configure C<-Dnoextensions=...> y C<-Donlyextensions=...>, vea F<INSTALL>.

source: open(FOO,$foo) || die "Can't open $foo: $!";
es_es: open(FOO,$foo) || die "No puedo abrir $foo: $!";

source: Evaluates to a list of the words extracted out of STRING, using embedded whitespace as the word delimiters.
es_es: Evalúa a una lista de palabras extraídas de CADENA, utilizando los espacios en blanco incrustados como delimitadores de palabras.

source: When C<use strict 'vars'> is in effect, C<our> lets you use declared global variables without qualifying them with package names, within the lexical scope of the C<our> declaration.
es_es: Cuando C<use strict 'vars'> esté activo, C<our> le permite usar variables globales declaradas sin calificarlas con nombres de paquetes, en el ámbito léxico de la declaración C<our>.

source: While it was current when we made it available, Perl is constantly evolving and there may be a more recent version that fixes bugs you've run into or adds new features that you might find useful.
es_es: A pesar de que estaba vigente cuando lo pusimos a su disposición, Perl está en constante evolución y puede haber una versión más reciente que corrige los errores que ha encontrado o añade nuevas características que le pueden resultar útil.

source: C<@DB::args>, like C<@_>, does not hold explicit references to its elements, so under certain cases its elements may have become freed and reallocated for other variables or temporary values.
es_es: C<@DB::args>, como C<@_>, no incluye referencias explícitas a sus elementos, por lo que en algunos casos sus elementos pueden haberse liberado y reasignado a otras variables o valores temporales.

source: =head2 Pragmata Changes
es_es: =head2 Cambios en la prágmata

source: Pointer to the linearisation function, described below.
es_es: Puntero a la función de linealización, descrita a continuación.

source: If your C<umask> were C<0027> (group can't write; others can't read, write, or execute), then passing C<sysopen> C<0666> would create a file with mode C<0640> (because C<0666 &~ 027> is C<0640>).
es_es: Si su C<umask> fuera C<0027> (el grupo no puede escribir; los otros no pueden leer, escribir o ejecutar), entonces pasando a C<sysopen> C<0666> creará un archivo con el modo C<0640> (porque C<0666 &~ 027> es C<0640>).

source: See L<perlre> and L<perlop>.
es_es: Ver L<perlre> y L<perlop>.

source: When a C<given> statement is also a valid expression (e.g. when it's the last statement of a block), it evaluates to :
es_es: Cuando una instrucción C<given> es también una expresión válida (p.e. cuando es la última instrucción de un bloque), se evalúa a:

source: Furthermore, when called from within the DB package, caller returns more detailed information: it sets the list variable C<@DB::args> to be the arguments with which the subroutine was invoked.
es_es: Además, cuando se le llama desde el interior de un paquete DB, caller devuelve información más detallada: actualiza la variable C<@DB::args> con los argumentos con los que la subrutina fue invocada.

source: pm.org?
es_es: ¿Y pm.org?

source: Most if not all systems implement lockf(3) in terms of fcntl(2) locking, though, so the differing semantics shouldn't bite too many people.
es_es: La mayor parte si no todos los sistemas implementan lockf(3) en términos de bloqueo con fcntl(2), aunque, las diferencias en la semántica no llame la atención a mucha gente.

source: No space between function name and its opening parenthesis.
es_es: Sin espacio entre el nombre de función y su paréntesis de apertura.

source: Fortunately, Perl handles this for us, so we don't have to worry about this.
es_es: Afortunadamente, Perl se encarga de esto.

source: For example, it tests that everyone who is listed in the git log has a corresponding entry in the F<AUTHORS> file.
es_es: Por ejemplo, comprueban que todas las personas que figuran en el registro de git tienen una entrada correspondiente en el archivo F<AUTHORS>.

source: C<$&> returns the entire matched string.
es_es: C<$&> devuelve toda la cadena coincidente.

source: $text =~ s/foo/bar/;
es_es: $texto =~ s/foo/bar/;

source: You will find this behavior is slightly different from that of C<$SIG{__DIE__}> handlers (which don't suppress the error text, but can instead call C<die> again to change it).
es_es: Usted encontrará que este comportamiento es ligeramente diferente a la de los controladores C<$SIG{__DIE__}> (que no suprimen el texto de error, pero puede llamar, en su lugar, a C<die> de nuevo para cambiarlo).

source: $n = "1234"; # number specified as a string
es_es: $n = "1234"; # número especificado como una cadena

source: In general, a module C<Foo::Bar> whose source was stored under F<ext/Foo/Bar/> is now located under F<ext/Foo-Bar/>.
es_es: En general, un módulo C<Foo::Bar> cuyo código fuente se almacenaba en F<ext/Foo/Bar/>, ahora se encuentra en F<ext/Foo-Bar/>.

source: The first alternative includes everything from the last pattern delimiter ("(", "(?:", etc. or the beginning of the pattern) up to the first "|", and the last alternative contains everything from the last "|" to the next closing pattern delimiter.
es_es: La primera alternativa incluye todo, desde el último patrón delimitador ("(", "(?:", etc o el comienzo del patrón) hasta el primer "|", y la última alternativa contiene todo, desde el último "|" hasta el siguiente delimitador de cierre del patrón.

source: C<q()>, C<qq()>, and the like are not supported in place of C<''> and C<"">, and the only interpolation is for backslashing the quoting character:
es_es: C<q()>, C<qq()>, y similares no están soportadas, en lugar de C<''> y C<"">, y la única interpolación es para escapar el carácter de entrecomillado:

source: If one wants the hook to do nothing in such situations, put
es_es: Si uno quiere que el gancho no haga nada en estas situaciones, ponga

source: It's important to realize that a regular expression is merely a set of assertions that gives a definition of success.
es_es: Es importante darse cuenta de que una expresión regular no es más que un conjunto de aserciones que da una definición de lo que consideramos un éxito.

source: If there is only one scalar argument or an array with one element in it, the argument is checked for shell metacharacters, and if there are any, the entire argument is passed to the system's command shell for parsing (this is C</bin/sh -c> on Unix platforms, but varies on other platforms).
es_es: Si sólo hay un argumento escalar o un array con un elemento dentro de él, se comprueba si el argumento tiene metacaracteres, y si hay alguno, el argumento entero es pasado al shell de comandos para que sea interpretado (suele ser C</bin/sh -c> en plataformas Unix, pero varía en otras plataformas).

source: On systems that support a close-on-exec flag on files, the flag will be set for the newly opened file descriptor as determined by the value of C<$^F>.
es_es: En sistemas que soportan la bandera B<close-on-exec> (I<cerrar en ejecución>) en archivos, esta bandera se establecerá para el descriptor de archivo abierto recientemente según lo determinado por el valor de C<$^F>.

source: F A Perl internal floating-point value (NV) in native format
es_es: F Un valor Perl interno de punto flotante (NV) en formato nativo

source: =head3 Changes to type-based dispatch
es_es: =head3 Cambios en el despacho basado en tipos

source: Other people picked up on this and started to write clever or obfuscated programs to produce the same output, spinning things quickly out of control while still providing hours of amusement for their creators and readers.
es_es: Otras personas adoptaron esta tendencia y empezaron a escribir programas astutos o enrevesados para producir el mismo resultado, y se descontroló el asunto, lo que proporcionó grandes momentos de diversión a sus creadores y lectores.

source: If EXPR is omitted, stats C<$_>.
es_es: Si EXPR se omite, stats C<$_>.

source: (Fixed by Dave Mitchell)
es_es: (Arreglado por Dave Mitchell)

source: \u titlecase (not uppercase!) next character only
es_es: \u siguiente car. en mayúscula

source: Returns the message queue id, or C<undef> on error.
es_es: Devuelve el identificador de una cola de mensajes, o el valor C<undef> si hay un error.

source: The actual sizes (in bytes) of native shorts, ints, longs, and long longs on the platform where Perl was built are also available from the command line:
es_es: Los tamaños reales (en bytes) de short, int, long y long largos nativos en la plataforma donde Perl fue compilado también están disponibles desde la línea de comandos:

source: (It's possible to do things with named capture groups that would otherwise require C<(??{})>.)
es_es: (De este modo es posible hacer cosas con los grupos de captura con nombres que, de otro modo, requerirían código C<(??{})>.)
